       IDENTIFICATION DIVISION.
           FUNCTION-ID. CONV-MON-TO-CRED.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 NUM-MON-AMOUNT PIC 99999.
           01 NUM-CREDIT-AMOUNT PIC 99999.
           LINKAGE SECTION.
           01 CREDIT-AMOUNT PIC 999.
           01 MON-AMOUNT PIC 999.99.

       PROCEDURE DIVISION USING MON-AMOUNT RETURNING CREDIT-AMOUNT.
           
           MOVE MON-AMOUNT TO NUM-MON-AMOUNT.
           COMPUTE NUM-CREDIT-AMOUNT = NUM-MON-AMOUNT * 10.
           MOVE NUM-CREDIT-AMOUNT TO CREDIT-AMOUNT.

           END FUNCTION CONV-MON-TO-CRED. 
