       IDENTIFICATION DIVISION.
       FUNCTION-ID. HIGH-SCORE-CALCULATOR.

       DATA DIVISION.
           LINKAGE SECTION.
           01 LS-HIGH-SCORE PIC 99.
           01 LS-WORD-LENGTH PIC 99.
           01 LS-GUESSES-LEFT PIC 99.

           PROCEDURE DIVISION USING LS-WORD-LENGTH LS-GUESSES-LEFT 
           RETURNING LS-HIGH-SCORE.
       
           COMPUTE LS-HIGH-SCORE = LS-WORD-LENGTH * LS-GUESSES-LEFT.

           
           END FUNCTION HIGH-SCORE-CALCULATOR.