       IDENTIFICATION DIVISION.
           FUNCTION-ID. VERIFY-PASSWORD.
       DATA DIVISION.

           WORKING-STORAGE SECTION.
           01 WS-FILE-IS-ENDED PIC 9 VALUE 0.

           LINKAGE SECTION.
           01 LS-PASSWORD PIC X(20).
           01 LS-PASSWORD-ENTRY PIC X(20).
           01 LS-RESULT PIC X(5).

       PROCEDURE DIVISION USING LS-PASSWORD, LS-PASSWORD-ENTRY 
       RETURNING LS-RESULT.
      
           IF LS-PASSWORD = LS-PASSWORD-ENTRY
                MOVE 'TRUE' TO LS-RESULT
           ELSE 
                MOVE 'FALSE' TO LS-RESULT
           END-IF.
        
           END FUNCTION VERIFY-PASSWORD.
