       IDENTIFICATION DIVISION.
       PROGRAM-ID. main-program.
       ENVIRONMENT DIVISION.
    
       PROCEDURE DIVISION.
           CALL "server".
           GOBACK. 

