       IDENTIFICATION DIVISION.
       PROGRAM-ID. main-program.
       ENVIRONMENT DIVISION.
           CONFIGURATION SECTION.
           REPOSITORY.
               FUNCTION CONV-CRED-TO-MON.
       PROCEDURE DIVISION.
           CALL "server".
           GOBACK.

